# AttachedParentId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Group..::..AttachedParentId Property
Group Class See Also
---
Indicates the Id of the parent group this group is attached to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public ElementId AttachedParentId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AttachedParentId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ AttachedParentId {
	ElementId^ get ();
}
```

# See Also
Group Class
Autodesk.Revit.DB Namespace